ARM/wwwroot/Xml/RegisterUser.xml

<?xml version="1.0" encoding="utf-8" ?>
<soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
                 xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
  <soap12:Body>
    <RegisterUser xmlns="http://armpension.com/">

      <RsaId></RsaId>

      <UserName></UserName>

      <Password></Password>

      <emailaddress></emailaddress>

      <dob></dob>

      <mobile></mobile>

    </RegisterUser>
  </soap12:Body>
</soap12:Envelope>